# First to clean basic data of csv file

In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv("data_cleaning_basic.csv")

df.head()

   Name   Age   Salary      City
0  John  28.0  50000.0  New York
1  Anna  22.0  42000.0     Paris
2  Mike   NaN  38000.0    London
3   NaN  35.0      NaN     Paris
4  Sara  29.0  52000.0       NaN